"[{\"content\":\"Overall a good product\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Camera quality is not good for this macbook air m1.its kind of blurry and I'm trying to replace with another but there is no replacement option for this now.\",\"content_sentiment_label\":\"negative\",\"verified\":\"Yes\"},{\"content\":\"The package delivered was awesome n product was genuine all.\\ud83d\\ude0a\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"this laptop is best for business purposes, with excellent battery backup, a crystal clear display. overall it is a very very lovely experience with MACBOOK AIR M1. Thanks, APPLE\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Working to fastly\",\"content_sentiment_label\":\"neutral\",\"verified\":\"Yes\"},{\"content\":\"Most value for money laptop right now ... amazing performance, got a good deal, for around 66K....\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I used MacBook Pro 13 inch of intel but this M1 chip from Air is too fast and quick response with better battery life.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I had fears about getting a laptop with passive cooling, even though I don't do video editing or compile big programs on the Air, even for web development and writing small scripts a fanless laptop seemed like a bad idea but after using this I can this thing is totally fine and wonderful Docker works fine some issues do come up but for simple development of C++, Python apps along with Postgres SQL docker with some configurations the M1 chip has so far caused no issues. I run vscode, pycharm the project is not too huge but with safari or chrome running with 6-8 tabs this wonder does not heat up or cause any instability. The display is the best I have used so far, the speakers are far better than equivalent windows laptops Some Cons: 1) No simple keyboard shortcut to control keyboard backlighting, 2) As a long-term windows user, the shortcuts like arrow key + Win key to resize apps\\/stack apps is something I truly miss, Mac does have its own multitasking\\/split screen way but I prefer windows installing a third party for this seems unnecessary 3) Battery life on 12.4 is a bit less than when I got the MacBook Air 4) Switching to Mac shortcuts takes a bit of time 5) Need to buy a type C Dongle, as I work of ethernet port mostly\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Value for money laptop If u r looking for programming this is the one It has better power efficiency,better screen quality, smooth & fast UI &  small in size M1 is  still better option...  M2  is good but  i think  there is no huge improvement between  m2 & m1  soo  if u hava 80k go for m1 mac instead of m2  if  u have high budget  go  for  pro model's dont go for basic ones\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Should i buy the 16gb ram from apple store? This was the question i had for a long time. After going through tons of videos that compares 8gb air vs 16gb there was a clear evidence that with my use i can still be happy with the m1 8gb ram variant. This is not a long term review but i shall update the review after few months of usage. Why i opted for 8gb ram? My use is browsing some secure pages, maybe watch some videos too. Use imovies to edit small videos (not heavy 4k long videos as such) but i have seen that this can support even editing 4k videos. But then definitely if you are someone who use it majorly for editing 4k videos then you should probably get the 16gb variant. Then i do a little bit of coding too. I do have a office laptop that is a 16gb ram intel one. I did try opening some youtube 4k vids in chrome and compared it side by side and initial impression is pretty good on how the m1 takes on the load. But I should wait for more to get the actual picture. So, if you are light user with basic use and not into gaming or anything. This laptop is gonna be more than enough for your use. As its very much portable and light weight. The battery is also heavily optimised. ( i tried all these and i am yet to do my initial charging \\ud83d\\ude0a). I shall update my review after 3-6 months for a better comparison. ***update after 10 months ***** No regrets! This is super fast engine. I do a lot of coding now with this. I feel every software works like a charm in M1 now. Of course we have the updated processor now. This is a start of a super powerful engine\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Received the product today by exchanging my old laptop(dell), been using it from sometime and i can already say its very awesome product that i had the luxury to own.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Best in class go for it ,works like charm.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Everything is awesome except camera and charging speed, for these two factors, one can go for m2 air, those 20k worth it, for future scope. I don't think read write speed would have that deep impact.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Hi, I have been an apple user- still have an old 2011 model. Then i switched back to dell for around 4 years. It's all good and smooth with Dell. And very recently I thought let me buy myself an Air. I like that its super sleek and somehow grey color is one of my favourites. So no surprizes the laptop comes in a nice packaging, (thanks to amazon for there on time and easy delivery). The only con of apple air is that its pricey but yes (if you are like me-you will realise its soon that in a long run, how this becomes such an important part of your life, its much more cheaper in value) Super Pro's 1. M1 processors are highly efficient in processing. Also thanks to SSD 2. Battery life is crazy- last for 15-16 hours easily 3. Look and Design (there's not much to say- its very obvious)- Super classy, sleek and very light weight. Con's 1. No cons It's the best version of any Macbooks till date. To be honest, I do multiple things- I design, I edit videos, I code, and I browse. Everything is good. I wish I could have ordered a bigger storage one though which was a bit expensive for me. So I treated myself with a very handy Seagate SSD 500 GB and I use it on the fly. Something extra to carry but I still LOVE it. Also, to let you know that- this is one of my first review that's written so throughly. So understand the excitement and satisfaction level of this product. WISH YOU LUCK! Now go and Buy. :)\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Go for it\",\"content_sentiment_label\":\"neutral\",\"verified\":\"Yes\"},{\"content\":\"Apple Macbook M1 2020 edition is an excellent piece of hardware bundle but the software platform is not suitable for many of the applications which work only on Windows PC. If and if only Apple sells its Macbooks for Windows operating system, it would be really a 10 STAR device. Pros: * Excellent SOC (System on chip) which is beyond any comparison. Intel and AMD have been left miles beyond. Their processors are antiquated & far short in performance. * The processor does not generate any heat - which indicates the cool operation and also low power consumption. There is no cooling fan in the laptop. The entire unit is sealed as there is no heat venting. * Battery lasts very loooong, even for HQ 16 K video playback. * Display is very realistic with true colours. * Sound quality is great. Channel separation is so good, you feel theatre like effect with sounds coming from all directions, far and near. Cons: * Very poor or no scope for expanding the RAM and storage size. * Software is expensive. * Additional compatible peripherals are mighty expensive. * Such pricey laptops come with only 1 year warranty. * Other than 2 C type ports and a earphone jack nothing else is present. One C port is engaged for power supply. Thus one has inflexibility of having to do with only one H.Speed \\\"C\\\" type USB port. * Windows users switching to Apple are cautioned. Compatibility, storage space, expandability are severely constrained. Finally, like the PC's which can take MS Windows OS and also other OS platforms, Apple range of MacBooks should also be compatible universally for all platforms, with hardware expandability options like PCs. with any Operating systems.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"This is the device that got me into Apple ecosystem, and this is a piece of peak engineering and worth every rupee I spent. No fans means the inside is completely isolated from the outside so no dust inside. Speakers and display are top notch. You can go for Mi Notebook with similar screen resolution but this one does not cause eye strain. Trackpad is one of the best I used. Battery life is unreal. Not for gaming though. If you are using it for just media consumption and some general programming then you will not feel it getting hot ever. Considering the price difference between M1 and M2 models, this is a better choice if you do not want to spend nearly 50% more on M2 Air.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Loved everything about this one. This one was a love at first sight but took me years to buy. I am really happy with the delivery and genuineness and it was worth it for INR 82,990. Thank you Amazon.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Hinge issues... Sometimes don't open by single handed... Rest everything is heaven\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"M1 chip is simply amazing. I use Final cut Pro (for Video editing) and it glides through 4k footage(that too with multiple layers of 4k footage). Super satisfied ... and that too at  Rs.78,990(in sale with card discounts) Huge value-for-money product.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Thanks to Amazon for quick and safe delivery \\ud83d\\ude4f This is my first MacBook from apple, the screen quality is good as I expected The sound quality is amazing, with a  real Dolby and surround sound from the speakers. \\ud83d\\udc4c The trackpad is quite interesting, I have never seen a such trackpad on any other laptop, \\ud83d\\udc4d Overall it is good to buy, go for it without hesitation.\\ud83d\\udc4d\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Best laptop in market\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Great choice for students and professionals  buy it don't think to buy any other OS\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Loved every bit of this gorgeous laptop. The screen, sound quality, touch, and keypad are amazing.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"This macbook light weight, battery capacity is quite good ,upto 13 hrs. Software are running smoothly.  Web cam is quality is good. Screen quality is good.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Macbook always delivers as expected. Great product.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"M1 is phenomenal in terms of performance and efficiency. It just works without any hiccups. Battery life is excellent. Easily a two day laptop with light to moderate use. If you are in the Apple ecosystem, go for it with eyes closed. Moreover, almost all apps have a universal binary now which targets ARM architecture specifically (instead of x86), which basically means more performance in all of these apps. So if you used this laptop more than a year ago and found bugs with the software, be rest assured that the bugs are no more and macOS is very stable now on this machine.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Bought 2 of these for Air and Pro Macs and fits perfectly for both, image attached.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Skipping the technical part since I'm sure most know about the M1 chip already. As a first time Mac user, I would say, switching to Mac from Windows was a very good experience for me. I didn't face any major issues. All I can say is that for professional and non-gaming use, this device is a monster. 11 hours of battery life easily, with video calls and multiple tabs and apps, along with windows on parallels ON, the whole working day! I never felt that I lacked anything. Even when there were power cuts, you can easily tether your phone or even better if you have an Iphone, and still keep going as if the power is still ON. From performance to battery life, design, everything is amazing. But do know that you'll need to keep an extra 10 thousand rupees spare to get accessories which are essential, such as cover, hubs etc. But overall a great buy as a minimum 5 year investment, and you can still expect some resale value. I was bit disappointed with the Amazon delivery executive though, he simple left the item with the watchman without taking the OTP and he then calls up for it. But apart from this, a great purchase!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Gud superpower delivery by Amazon on time\",\"content_sentiment_label\":\"neutral\",\"verified\":\"Yes\"},{\"content\":\"Insanely powerful and starkly, very efficient too. Easily lasts a week after full charging. The M1 is a beast and handles everything smoothly. The finish, feel and look is top notch premium just as you expect from Apple products. The display is gorgeous crisp and has a high contrast, the sound quality is excellent too.  Its really the best laptop not just at this price point but even above. This is a machine you should buy if you are looking for a laptop at this price range. Apple just makes beautiful powerful machines and this one is just on another level. The M1 chip is a revolution. Yes there\\u2019s a learning curve when you switch from Windows to Macintosh but nothing which can\\u2019t be learnt. Unless you are really bent on using Windows only, this is the laptop to go for.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The media could not be loaded. Liked the product\",\"content_sentiment_label\":\"negative\",\"verified\":\"Yes\"},{\"content\":\"My first Mac, so far had no issues, in 15 days hanged once for 15 secs during shutdown, else everything is good. Absolutely no noise and no heating. Battery backup average 9-10 hours for moderate usage (browsing, movie, youtube, streaming etc). If pocket permits then you can have this blindly without even attempt to comparing with other PC. Updates on 14th Apr'22 Well! Performance is still good but a big problem appeared in battery. Randomly shutting down with 74% battery left without any warning. It doesn't turn on until I plug the power adapter. When the laptop opens it shows battery at 11% and takes very little time (10-15 mins) to reach 100% battery level. Then after I unplug, from 100% to reach 74% it takes normal time (no abrupt drainage here), but once it goes around 74% it again shuts down, and the loop continues. However no problem while keeping on power. But this is not good sign from such a costly device. Not sure on if battery is required to be replaced. If someone knows a solution please let me know, this may help others also. Cheers !\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The battery backup is just awesome as it easily lasts me for more than a day with non-stop browsing and surfing the internet and use of google chrome.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Superb Product! With this macbook i have fully become a member of the apple Ecosystem. Happy about it. Thanks Amazon\\u2665\\ufe0f\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"This machine truly deserves the price tag we pay. We often think that Apple products are super expensive, and yes, they are, but they provide extraordinary value. 1-Like the very high quality SSD that runs at 3000mbps, 2-built like a tank with such a thin form factor, 3-and speakers, man, you never\\u00a0had speakers on a laptop ever like that. They are just perfect. 4-The screen is a 2K with very good brightness and the best possible colour accuracy.\\u00a0I guess at this price, no other brand offers this level of display. 5-The battery needs no introduction; it's above\\u00a016 hours in my\\u00a0tests, . 6-And the M1, again, a laptop with this CPU can even be compared\\u00a0with a high-end desktop, 7-And as for the last MacOS, it's the most polished OS I've ever used. Everything you get on an Apple product is of very high quality.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Buying apple laptop is an investment for me. If you have money then please go for it. It will give you great productivity. Battery life is awesome. Do not buy it for watching YouTube and movies (ignore this if you are parents rich).\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The Macbook air is really cool and works without any glitches. Some personal learnings for me. If you want to install MS teams, without a second thought go for 512 GB configuration as Teams is asking for 263GB space on the hard disk which is more than what the default 256 GB. Second learning is about Safari stopping auto refresh for sites like trading view charts, to save power. Need to explore how to disable such power saving for browser.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Honest review! If you ever dream a laptop with fastest ever in terms of speed while opening the screen, no lag, Quality (picture and sound) the performance, Highly top Notch! I will never ever buy Windows laptop at all. Apple is just out of the world!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I was very happy with my decision to go with Apple instead of other brands. It is very handy to work and move along, no heating issues at all, battery life is unbelievable, almost for 15 hours plus, which is very convenient. It\\u2019s life expectancy is more than other brands, a quality product with neat finish and looks very premium. Only downside is USB hubs, one need to buy an USB C external hub. Thanks Apple for making such a great product Apple MacBook Air M1.Camera not tested yet.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"It's awesome.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Battery life (15hrs) is like nothing I have seen before but this is only if u run native apps or the ones optimised otherwise it will drain quickly but still manage to give you around 10 hrs. Screen and audio  is ek number. Number of ports is a bummer though. M lovin it...\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I'm writing this after 2 weeks of usage.. I was a windows user before.. If you're going to spend \\u20b960k+ for a laptop, and if you're able to spend a little more, Macbook Air would be the best option.. It'll never be a regret. It's such an amazing machine. On time delivery and well packed.. I got a genuine Apple product. You can't compare it's performance with even \\u20b91L windows laptop..\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"This is the second apple laptop which I have purchased after Macbook Pro 2015 retina model and due to budget constraint I went with MCA istead MBP. But still this MCA has blown away my mind all thanks to M1 chip. Great display quality, sleek design, light weight, super speed, good sound quality are some of the pros of this product. All together it was good purchase decision hence go for it and you'll never regret the purchase. But remeber officially this is Mac OS and not Windows OS.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I have been using for about two weeks and I am very happy with the performance this Laptop gives. There are only three things which I\\u2019m not comfortable with, 1. When you open the laptop, you will need both hands, one to hold down the base part of the laptop and another to hold the lid else you will lift the laptop instead of opening. 2. The caps lock key is bit tight to press, not like other keys. But it still works fine, I just have to press a little harder then I press other keys. I don\\u2019t think this is an issue with all the macbook. 3. The USB ports are to closed to each other. It gives me some problem when I wanted two USB device in a same time. Other then these, I am very happy.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Upgrades were anyway required for the Air product line. As expected Apple provided a good update like Pros: 2K Screen Figure print Large trackpad Fast processor Improved key pad. Overall size is good Cons: The camera is still the same as the older MacBook air Rest is good with exchange, discount and payback. I get this machine at 55000\\/- Overall its a good deal\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"It is worth every penny. I have my work laptop hp elitebook 360 of Rs. 1.5 lakhs, but it heats when I'm not using it, but this macbook does not heat when using extremely. During the update, it heats up a little. It will take to get used to mac os, if you're a long time windows user. Screen quality is amazing, sound is also good.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"What to say about the MacBook. The name is enough in itself. The laptop battery life is astounding. It remains super cool in winters as it has aluminium body. What we expect more from apple is an inbuilt MS office for MacBook\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Altogether different experience for the people who habituated windows and then start with Mac OS.  So far, good. A tiny and light weight laptop makes you feel very comfortable as it can be carried very easily with flexibility.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The media could not be loaded. It's serving its purpose that's more than enough for me. Screen Quality is Superb. Really Loved the Sound. I read some bad reviews, I was worried but It's a great deal overall, I don't face any issues yet. Also, I confirmed with Apple with Warranty and all that stuff, everything is alright. Recently bought Portronics M31c and it's serving it's purpose well. Most importantly I got it for 79k\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The M1 Chip has brought a revolution in the Apple Eco System. MacBook Air has been my favorite product I have been using it since 2016 when decided to upgrade it after my system started slowing down during multi task. The new laptop gives me satisfaction and value for money. Hope it stays with me for the next 5 years.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Good laptop, but MS Excel do not work as compared to windows OS. Alt shortcuts do not works through Mac OS, that irretate me a lot.. Good sound, display, build, aluminium body,,,\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Battery backup is great, overall performance is also good.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Awesome products. Unbelievably fast and responsive. It would take a day or two to get accustomed if you are moving from windows to mac.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Pros: Excellent built quality Thin and light Fast processor Sharing with my apple phone is a delight Everything good about apple Cons: Connectors - only 2 type c ports on this, needs to buy a connector device Noticed a bit of heat while editing a 4GB video footage. Needs a little bit adapting if migrating from a windows ecosystem\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I was a bit hesitant to switch from Windows to Mac, however, the transition has been seamless. The user interface and software optimization is excellent. Absolutely loved it!!!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Screen quality is more than superb...camera quality is not great but better than any other laptop in this price range...and i am completely  happy with battery life, remember its not gaming laptop..if you are planning to buy a laptop in 70k range , spend some money extra and buy this product.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"First....I was getting nervous ...should I buy from amazon or from store.....finally made decision and ordered from amazon......Its 100% original product...I have chacked everything, every youtube trick to find that the product is genuine  or not.... It's 100% original product and got every benefits  like 1 year warranty and apple care service......\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Well this is my first mac book! It's been more than 2 weeks!  So far I have no complaints. Laptop boots up within 10 secs, battery life lasts more than 3 days. I have been doing basic stuff like browsing, connecting my ssd to transfers and watching movies to videos. I am not sure if its worth the money though as its pretty expensive for the basic model which is 86900 inr. As we know already its a fan less model, it literally has zero noise, it's gets very little warm on the surface after and hour or two of usage.  Will give an complete review post 2 months.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I love this products battery. It will be use 18 hrs continuously for coding purpose without playing any songs or movie.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Everything about the product is just so premium battery last for 3-4days depending on the work u do I have being watching IPL matches as well and doing my usual email stuff along with Netflix prime and Hotstar, overall a great product value for money\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"It is worth investing in MAC because it gives whole new experience of using a laptop.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"value based buying improved performance compared to old macbooks\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The M1 based MacBook Air is simply the best laptop you can buy right now. With the MacBook Pro also using the M1 it's the first time in years that the Air's specs are almost identical to the Pro's at a much lower price point. For those worried most common applications like Chrome are already available native for M1. Other non native apps also work flawlessly. Pros: 1. Noiseless 2. High screen clarity 3. Battery life of 3-5 days on average use 4. Very light 5. Fingerprint sensor 6. Keyboard is so nice you feel like typing more Cons: 1. Not a big fan of true tone but you can always turn it off\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I got 512gb\\/8gb macbook air for mostly programming and development related tasks. But it's not good enough to handle multiple applications. I run chrome and intellij simultaneously and it hangs too much. The worst thing is you can't even upgrade your ram. Frustrated.\",\"content_sentiment_label\":\"negative\",\"verified\":\"Yes\"},{\"content\":\"DEFECTIVE ITEM DELIVERED. STOPPED WORKING IN 2 HRS. Went to APPLE service center to get it checked. They told a defective item has been sold to you with hardware damage. When contacted seller and AMAZON for support Amazon refused to replace despite their being a 7 day replacement guarantee and all valid documents provided by Apple service center stating defective item. NEVER BUY ELECTRONICS FROM AMAZON. Go to a physical store. It might be expensive but won\\u2019t be defective. Amazon won\\u2019t help you at all after it has sold the product. They won\\u2019t even take your calls. Saying from personal experience.\",\"content_sentiment_label\":\"negative\",\"verified\":\"Yes\"},{\"content\":\"base storage should be 512gb. And base ram should be 16gb for pricey device like macbook. Apple needs to move macbook Air manufacturing to India like iphone.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The best laptop I have ever used! I switched from windows to apple for the very first time. And it was worth it. This piece begs you to keep working! The most significant plus point is definitely battery life. I charged it on one Saturday night and with daily usage of nearly 1-2 hours of YouTube and coding, till next Sunday it was at 19%. Just mind-blowing! Display is awesome, sound is awesome too! Definitely worth it\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"As accepted\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I have been using the product for the past two weeks or so and literally there is no negative aspect with this product. Only thing which could have been better is the USB ports. Otherwise one could just close your eyes and simply go on for it ! Best price to value laptop for sure !!!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"I was skeptical about the screen 13.3 inch 16:10 size but got used to it quickly. The battery do really lasts more than I expected. Its built very solid. The screen is phenomenal colorful good for photo editing ,sharp, black text looks bit grey. M1 processor makes this laptop sorry macbook very fast . I would recommend to buy it. Through discounts and exchange offer i got base version at 77k.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Since the warranty expired, i have been facing heatness issue. While using the Mac, the heat is getting increased. Even the charger adapter is also getting hot, while charging. Now because of the overheat, l the camera is affected. The camera is not opening. I approached online Apple service center, after initial diagnosis, they told to visit the the center in person. Is it designed in such way that the issue has to occur after the warranty period?\",\"content_sentiment_label\":\"neutral\",\"verified\":\"Yes\"},{\"content\":\"Box received unsealed, Charging adapter and charging cable is missing from the box.\",\"content_sentiment_label\":\"negative\",\"verified\":\"Yes\"},{\"content\":\"I took lot of time to take a decision to invest money on this laptop. Finally, I'm very much happy that it exceeded my expectations. Pros: Good battery Sound Display Keyboard Cons: Camera quality (But with proper lighting, its not a major issue) Cost of accessories.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The main difference from Intel chip MacBook is that M1 chip MacBook Air is always 3-4 degrees cooler, it gives you better battery life. Also sound quality of this MacBook is amazing. It\\u2019s high time Apple did something another the web cam. Compared to any iPhone, MacBook webcam is very primitive!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Good product I liked\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"This machine is a beast performance wise. I see a considerable amount of performance and power packed in M1. Loving it..\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Nothing is better as far as quality, technology, ease of working and all is concerned when it comes to apple. Really nice . 256 GB very good for normal routine usage.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Its my dream laptop ...Battery backup is unbelievable compared to windows laptop ...if u can afford it.u can absolutely go for it\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Pros 1. Best performance 2. Light weight, can use during traveling 3. Screen quality nice 4. Sound is above avg Cons I cant find it.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The best thing about apple is that it wont compromise on any spec\\u2019s. It has a great battery life with 15 hours plus screen on time. Best in its price. I\\u2019m very much satisfied with my purchase.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Camera quality is very poor but overall a good laptop to buy\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Very good product Battery - For online classes for 8 hours each day, works 2 days! without charge Weight - Extremely light weight! Easy to carry Camera - Camera quality is excellent Keyboard - Backlight is there and smooth button with sensor Touchpad - very smooth Screen - Clear Everything is good!! Thanks for this product\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Touch pad stopped working after an update apple being apple not surprised. Using with Bluetooth mouse. Better go with other brand than apple (if you are just going to showoff like me personal opinion) .\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"The best laptop I have ever used...period!!! awesome battery life very good screen resolution speakers are fantastic light weight and portable excellent performance from M1 chip, so for I have never experienced any heat issue. Great laptop from apple for the 1st time which balanced both performance and money! Good Job Apple!!!!\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"A big steal for the price...So happy for the purchase\",\"content_sentiment_label\":\"neutral\",\"verified\":\"Yes\"},{\"content\":\"What can one say, it's a must have for anyone who loves more than 5 feet away from a switch board. Just buy it and get it over with, don't overthink.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"},{\"content\":\"Easily the best laptop I have used ever. It\\u2019s super fast just as your iPhone.\",\"content_sentiment_label\":\"positive\",\"verified\":\"Yes\"}]"